#include <stdio.h>
#include <locale.h>

void main()
{
    setlocale(LC_ALL, "RUS");
    puts("                                                                  ");
    puts("                        |\\                                       ");
    puts("                        | \\                                      ");
    puts("                        |  \\                                     ");
    puts("                   _____|___\\____                                ");
    puts("            ______/              \\____                           ");
    puts("       ____/                         __\\__                       ");
    puts("      /___________________________________\\__                    ");
    puts("      \\                                     /                    ");
    puts("       \\___________________________________/                     ");
    puts(" ~~~~~~~~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~^ ~~~~   ");
    puts("             Выполнил: Ярославцев Е.А                             ");
    return 0;
}